#include "ui.h"

#include <iostream>

namespace ui
{
    void ShowObjects()
    {
        std::cout << '\n';
        std::cout << "========== РОЗПОДІЛ УЧБОВОГО НАВАНТАЖЕННЯ ==========" << '\n';
        std::cout << '\n';
        std::cout << "Оберiть об`єкт:" << '\n';
        std::cout << '\n';
        std::cout << "1. Викладачi" << '\n';
        std::cout << "2. Дисциплiни" << '\n';
        std::cout << "3. Групи" << '\n';
        std::cout << "4. Навантаження" << '\n';
        std::cout << '\n';
        std::cout << "5. Пошук" << '\n';
        std::cout << '\n';
        std::cout << "0. Вихiд" << '\n';
        std::cout << "-----------------------------------------------------" << '\n';
    }

    void ShowOptions()
    {
        std::cout << '\n';
        std::cout << "-----------------------------------------------------" << '\n';
        std::cout << "Оберiть опцiю:" << '\n';
        std::cout << '\n';
        std::cout << "1. Додати" << '\n';
        std::cout << "2. Переглянути" << '\n';
        std::cout << "3. Редагувати" << '\n';
        std::cout << "4. Видалити" << '\n';
        std::cout << '\n';
        std::cout << "0. Повернутися до об`єктiв" << '\n';
        std::cout << "-----------------------------------------------------" << '\n';
    }
}
